:: +-------------------------------------------------------------------------+
:: | Джентльменский набор Web-разработчика                                   |
:: | Версия: Денвер-3 2013-06-02                                             |
:: +-------------------------------------------------------------------------+
:: | Copyright (C) 2001-2010 Дмитрий Котеров.                                |
:: +-------------------------------------------------------------------------+
:: | Данный файл является частью комплекса программ "Денвер-3". Вы не можете |
:: | использовать  его в коммерческих  целях.  Никакие другие ограничения не |
:: | накладываются.  Если вы хотите внести изменения в исходный код,  авторы |
:: | будут рады получить от вас комментарии и замечания. Приятной работы!    |
:: +-------------------------------------------------------------------------+
:: | Домашняя страница: http://denwer.ru                                     |
:: | Контакты: http://forum.dklab.ru/denwer                                  |
:: +-------------------------------------------------------------------------+

@echo off
..\..\usr\local\miniperl\miniperl "Control.pl" %1 %2 %3 %4 %5 %6 %7 %8 %9
exit;
