<?$TITLE = "403 Forbidden"; include "../_header.php"?>

You don't have permission to access <?=$_SERVER['REDIRECT_URL']?> 
on this server.<P>

<h2>Подсказка Денвера</h2>

Возможные причины ошибки:

<ul>
<li>Вы пытаетесь запустить CGI-скрипт, расположив его <i>вне</i> CGI-директории 
(например, в директории документов сервера www). Корректные пути к CGI-директориям 
следующие:

<p><?include "_pathes.php"?>

<p>При большом желании вы все же можете запускать скрипты и из www-директории. Для этого 
создайте в ней файл <tt>.htaccess</tt> (с точкой в 
начале) следующего содержания:
<pre>
Options +ExecCGI
</pre>

<li>Возможно, вы пытаетесь открыть картинку или статический HTML-файл, расположенный 
в CGI-директории. Этого делать нельзя. Все рисунки (а также другие файлы, за исключениям 
скриптов) необходимо помещать в www-директорию. См. примеры по адресу <tt>/home/localhost/www</tt>. 


<li>Если вы ожидаете получить листинг каталога, но выводится эта ошибка, вероятно, для
данной директории выдача листинга запрещена (например, это CGI-папка). Чтобы 
разрешить листинг, создайте в нужной директории файл <tt>.htaccess</tt> следующего содержания:
<pre>
Options +Indexes
</pre>


</ul>

<?include "../_footer.php"?>