#!perl -w
# +-------------------------------------------------------------------------+
# | Джентльменский набор Web-разработчика                                   |
# | Версия: Денвер-3 2013-06-02                                             |
# +-------------------------------------------------------------------------+
# | Copyright (C) 2001-2010 Дмитрий Котеров.                                |
# +-------------------------------------------------------------------------+
# | Данный файл является частью комплекса программ "Денвер-3". Вы не можете |
# | использовать  его в коммерческих  целях.  Никакие другие ограничения не |
# | накладываются.  Если вы хотите внести изменения в исходный код,  авторы |
# | будут рады получить от вас комментарии и замечания. Приятной работы!    |
# +-------------------------------------------------------------------------+
# | Домашняя страница: http://denwer.ru                                     |
# | Контакты: http://forum.dklab.ru/denwer                                  |
# +-------------------------------------------------------------------------+
##
## This file contains stub for creating custom starters.
## You may delete it if you want.
##

package Starters::???;
BEGIN { unshift @INC, "../lib"; }

use Tools;
use Installer;
use StartManager;


StartManager::action 
	$ARGV[0],
	PATH => [
	],
	start => sub {
		###
		### START.
		###
		print "‡ ЇгбЄ Ґ¬ ???...\n";
	},
	stop => sub {
		###
		### STOP.
		###
		print "‡ ўҐаи Ґ¬ ???...\n";
	},
	_middle => sub {
		###
		### MIDDLE: after "start" or "restart".
		###
	},
;

return 1 if caller;